
#这就是2016的我
---
	 
                 ---每年的自己,也要审视一下,自己走过的路,是荆棘还是平川,审视自己走过的脚印.是深是浅;整理一下得失,是值是弃.



#先整理一下这一年的学习.
---

##基础部分

学校的自己,焊接电路板,手动焊接单片机最小系统,用matlab做个图像处理,用过传感器做比赛,用虚拟电子设备labview做过信号过滤转换,用汇编写写单片机的流水灯,只会简单的C,C++,然后写一个Helloworld, 用MFC写一写简单的图形界面.玩过linux,玩过android,玩过web.

###javaWeb部分
1. javaWeb部分, html,css,jsp,js,servlet,现在想想,估计只能是能看懂了,有些忘了.
2. 数据库部分,MySql的简单连接和使用,sqlite,接触过oracle,现在还剩下基本的语法.


###数据结构和算法
由于之前自己是电子信息专业,涉猎电子,信号,底层的东西比较多,数据结构还是了解的比较少.

在2016的9月份左右,自己开始看数据结构和算法的部分.看的是网络上的视频教程,<<2017年数据结构联考复习指南>>,还有<<算法>>在读,<<编程珠玑>>在读.

###Linux
额,自己买了,阿里云的云主机,
服务器方面,配置了docker容器,然后搞了几个ngnix服务器,tomcat服务器.让自己的几个web和rtmp推流跑了起来.

NDK方面,配置了ndk编译环境.

##开发语言方面

###C/C++复习
为了JNI和NDK,还有Android源码,自己重新拾起了C/C++.

###Shell脚本
在学习FFmpeg的同时,把Shell语法撸了一遍,现在,只能剩下能看懂Shell,然后会写一点Shell.

###设计模式
自己在11月份和12月份,结合视频和[[Runoob.com]](http://www.runoob.com/design-pattern/intercepting-filter-pattern.html)学习了23中设计模式,体会很深.学完之后,觉得自己写的代码不能再烂了...

还有,AOP模式在Android中的应用(Aspectj的应用)等等.


###java基础
对于android来说,java基础也很重要.包括代码的规范性,注释的规范性等等.自己看完了<java核心技术卷I,II>,体会到了,细节很重要.正在看<java编程思想>,还有下一步的 <Effect Java>.

在16年的4月份左右,**研究插件化**的过程中,研究了dex分包,差分更新,热修复,插件化等等,同时也让我对dalivk VM的Dex机制有所了解.

在17年的一月份,自己的书单中,有了一本<深入理解Java虚拟机>,希望自己能在其中解决自己困惑(虚拟机的执行过程,类加载过程,线程协作,java内存详细等等,自己思考过,也看过大量博客,却依然找不到想要的答案...)



##Android方面
---

###应用层
在项目开发的过程中,自己对java和android的API更加的熟练.能更加便利的运用手中的代码.不管是UI的最佳布局研究,交互的最简方式,如何高效的数据转化传输等等.

在应用层的研究中,通过视频和文档,研究过android中的内存泄露,UI的事件分发,视图的渲染过程.


###原理层
研究过Android消息机制,UI渲染流程,深入内存泄漏,图片和网络优化等等.
在看源码的过程中,学会了通过UML时序图的分析,来梳理思路.

编译过Android4.0.3的源码.

对Android有了一份重新的认识.

2017年,准备在编译版本Ubuntu12.04上研究Android的内核,准备开始研究裁剪Android系统~

###NDK方向
NDK方向,是自己感兴趣的地方,在linux中编译过ffmpeg,yuv,bifzip等等,优秀的开源库文件.


###项目迭代
感谢公司,给了机会.在公司的项目的从0到1,再到不断地迭代更新中,深刻体会到代码整洁度,解耦,技术选型,模块分工,设计模式,代码风格,项目架构的重要性.

当然,也意识到了自己的知识的匮乏,当你想要对一个问题进行展开分析的时候,会牵连出一整个知识网络.

我想,还是自己对基础的掌握没有那么好,对技术的把控力没做到吧.



##这是今年的我~

###我的剑法修炼,[想要集齐各种剑法于一身.](https://github.com/ccj659)

- [主流框架MVP(项目架构)+Retrofit(网络访问)+Rxjava(响应式编程)+EventBus(事件总线)](https://github.com/ccj659/clean-project-architecture);

- [一个面向对象的数据库框架](https://github.com/ccj659/dbhelper)

- [差分更新](http://blog.csdn.net/ccj659/article/details/52517933)

- [ffmpeg音视频](http://blog.csdn.net/ccj659/article/details/52636772)

###我的内功修炼,[正在潜心修行的博客.](http://blog.csdn.net/ccj659)

- [Android应用开发](http://blog.csdn.net/ccj659/article/category/6173976)

- [Android性能优化](http://blog.csdn.net/ccj659/article/category/6167216)

- [设计模式和架构](http://blog.csdn.net/ccj659/article/category/6236002)




 

#2016年的经验和教训
---

##体会
2016年有两种感觉

1.**书到用时方恨少!!!**

2.**有了理论基础和思路,但是无法完成从思想到实现的转变.**

3.**很多东西,网上找不到自己想要的答案,这也就是我为什么买书的原因**

##关于新事物
2016年,确实接触到了不少新东西,也听到了很多人说什么技术即将过时,什么技术要火,自己也思考过,迷茫过.作为一名社会新人,一路走来,还是要感谢那些帮助过我的人.

在互联网的浪潮中,终于明白,要努力做到能力出众,内力深厚,才会淡看互联网的风起云涌~~


##关于思绪

研究问题的时候,每次都是研究的时候,突然的 扯出另外一个概念,然后就爱上了另外一个方向~~,只能把它研究到自己又一个自己的认识的时候,自己才会收手...可能是自己基础太弱了吧~ 总想把东西看透看完. 还是自己的内力不够高深吧~没有内力,只会用剑.把戏而已.高手过招,内力为上.就像一座建筑,地基决定了他能承重多少,建多高,用多少年.


个人兴趣也很重要.个人喜欢在做一件事情之前,把他的原理,事件搞明白.

##基础的重要性

追了一年的新技术,慢慢的发现,所有的技术,都是从基础开始.所以自己想沉下心,做一点事情

简历中的如此简单的一句"熟练java,细想起来,原来自己是这么的无知"
发现自己,在薄弱的基础之上,去理解高深的代码和设计..,邯郸学步.


欲速则不达~鞭策自己稳步前行,旁击侧通,举一反三~



##发现发现自己不会的越来越多了...

经验: 用Google,用Google,用Google,重要的事情说三遍...

源码自有颜如玉,源码自有黄金屋...

知识和知识之间,都有着千丝万缕的联系.道理还是要自己体会,才能更加深刻!

学习其实也是一个快乐的过程,因为在你学习的过程中,可以顿悟之前的种种不解.

发现越来越讨厌自己以前写的代码...



#希望2017年的自己是这样子的
---



##技术上

按照时间顺序

0. 保持住对技术的好奇心.


1. 首先要完成,我的书单的顺序阅读,并温故知新.


2. 完成个人域名博客的搭建[域名正在备案,期待~],并进行博客转移.


3. 学习React Native 和部分H5,准备开发混合APP.


4. 将插件化,应用到实际项目中去.


5. 继续完成自己准备开发的[app(包括app和后台)](https://github.com/ccj659/clean-project-architecture).


6. 学习Framework层,并做一些修改,裁剪的事情~


7. 研究NDK,完成一部分java大量计算,渲染等代码的转移.


8. 研究Android逆向,并将自己的项目进行安全加固.


9. 写一个自己的app,包括客户端和服务端,开源并上线.

##生活中

话说得好,神仙,也得过日子.....

1. 准备买房......沉重的话题...
2. 虽然没有几个钱,但是也要学习理财,钱生钱~哈哈~~
3. 健身!有腹肌和胸肌的我,毕业半年后,养了一冬天,居然胖了20斤...
4. 每周打几次篮球,现场看几场CBA,还有,希望CBA和裁判能尽早的改革... 
5. 最后,不要再掉头发了,拜托...




##2017年书单

**初衷----**

**就像有些人说的,别人的经验,有的时候,不亲身体会,永远不会真正理解.**

**书中自有颜如玉,书中自有黄金屋~**

**经历了2016年,重重的困惑,断断续续的思绪,想不通,理还乱.**

**现在,我已经深刻体会到了~**



1.**jvm相关** 深入理解JAVA虚拟机 (想看它,想了很久)

2.**EFFECT JAVA**

3.**Java多线程编程核心**

4.**编程珠玑**

5.**Android开发艺术探索**

6.**APP研发录**



#写在最后,告诉自己
---

2016年
---
这一年,经历了毕业,分别了大学的兄弟,心痛伤怀.
这一年.自己找到了自己的学习方法--只想不做假把戏,学习要有学习,实践,和总结.
这一年,给了自己足够多的压力,当然也得到了我想要的成长.




现在回头看看,自己在走过的路上,拾到了很多很多东西...

总的来说,2016年,生活上,小资惬意;人生道路上,自己收获了很多很多~


2017年
---
身体健康,顺利完成17年计划,不要浪费时间!

一起加油!为了爱我们的人们!

1/19/2017 11:52:30 AM 


                                                                
   
